export const code = `

функција израчунај(н, операција) {
    нека резултат добија вредност 0

    ако (операција је једнако "множи") {
        резултат добија вредност 1
    }

    за (нека број буде 1; број мањи од н + 1; број увећај за 1) {
        ако (операција је једнако "сабери") {
            резултат увећај за број
        } у супротном ако (операција је једнако "множи") {
            резултат помножи са број
        } у супротном {
            испиши("операција неподржана")
            прекини
        }
    }

    врати резултат
}

израчунај(3, "множи")

`;


функција таблицаМножења(н) {
    нека таблица буде Низ()

    за (нека број буде 0; број мањи од н; број увећај за 1) {
        нека ред буде Низ()

        за (нека број2 буде 0; број2 мањи од н; број2 увећај за 1) {
            ред.гурни((број + 1) * (број2 + 1))
        }

        таблица.гурни(ред)
    }

    врати таблица
}

JSON.stringify(таблицаМножења(5))
