export const singletonCode = `

класа СтратегијаПлаћањаКартицом {
    функција плати(купац, цена) {
        дај да { име, бројКартице } буде купац
        сачекај банка.плати(име, бројКартице, цена)
    }
}

класа СтратегијаПлаћањаБиткоином {
    функција плати(купац, цена) {
        дај да { име, бтцАдреса } буде купац
        дај да бтцЦена буде биткоин.конвертуј(цена, "рсд")
        сачекај биткоин.плати(бтцАдреса, бтцЦена)
    }
}

класа СтратегијаПлаћањаПоузећем {
    функција плати(купац, цена) {
        дај да { име, адреса } буде купац
        дај да курир буде нови Курир()
        сачекај курир.позови(име, адреса, цена)
    }
}

класа Корпа {
    конструктор() {
        ово.производи добија вредност Низ()
        ово.стратегијаПлаћања добија вредност празно
    }

    функција изабериСтратегијуПлаћања(стратегијаПлаћања) {
        ово.стратегијаПлаћања добија вредност стратегијаПлаћања
    }

    функција израчунајЦену() {
        нека сума буде 0
        ово.производи.заСваки(производ => {
            сума += производ.цена * производ.количина
        })
        врати сума
    }

    функција извршиПлаћање(купац) {
        нека укупнаЦена буде ово.израчунајЦену()
        врати ово.стратегијаПлаћања.плати(купац, укупнаЦена)
    }
}

дај да корпа буде нова Корпа()

корпа.производи.гурни({назив: "ракија", цена: 135, количина: 20})

корпа.изабериСтратегијуПлаћања(нова СтратегијаПлаћањаБиткоином())

корпа.извршиПлаћање({
    име: "Пера Сатошић",
    бтцАдреса: "37XuVSEpWW4trkfmvWzegTHQt7BdktSKUs"
})


`;
